Autodesk.Revit.DB.DirectShapeType.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Sets the type shape to a copy of the supplied collection of Geometry objects.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects. These will be copied.
Shape and Category should be consistent: geometry supplied as shape should be valid for the Category
the type object is associated with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShapeType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId)
Creates a DirectShapeType element.
document:
The document that will contain the new element.
name:
Name of the DirectShapeType.
categoryId:
Id of the category assigned to this DirectShapeType. Must be a valid category id.
Returns:
The new DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015